In [5]:
import pandas as pd
df=pd.read_csv("income.csv")
d=df.copy()
d
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [2]:
df.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [3]:
for i in df.columns:
    print(i)

GEOID
State
2005
2006
2007
2008
2009
2010
2011
2012
2013

In [4]:
df.loc[0:]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [22]:
df[["2010"]]

    2010
0  40933
1  57848
2  46896
3  38587
4  54283

In [8]:
#to find the sum of a particular column
s=0
for i in df["2010"]:
    s=s+i
print(s)

238547

In [12]:
#to find the sum of a row
df.iloc[1,2:]

2005    55891
2006    56418
2007    62993
2008    63989
2009    61604
2010    57848
2011    57431
2012    63648
2013    61137
Name: 1, dtype: object

In [14]:
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(s)

540959

In [15]:
df["2010"].sum()

238547

In [16]:
# 4th row and all columns sum
df.iloc[4,2:].sum()

498154

In [23]:
#sum of 2005 to 2008 columns
df.iloc[:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [28]:
a=df[["2005","2006","2007","2008"]].sum()
a.sum()

976808

In [30]:
df.sum() #to find the total sum of individual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [34]:
a=df.sum(1) #to find the toatl sum of individual rows
a

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

In [44]:
# prod() to find the product
a=df.iloc[1:2,2:8].prod()
#a.prod()
a

2005    55891
2006    56418
2007    62993
dtype: int64

In [47]:
#mean() to find the average
print(df["2011"].mean())# find the avg of 2011 column
print(df.iloc[2,2:].mean())#find the avg of 2 nd row

48662.2
48967.88888888889

In [48]:
#median()
print(df["2011"].median())# find the avg of 2011 column
print(df.iloc[2,2:].median())#find the avg of 2 nd row

48621.0
46914.0

In [7]:
df["2011"]==max(df["2011"])

0    False
1     True
2    False
3    False
4    False
Name: 2011, dtype: bool

In [100]:
d.iloc[:,2:]
#d.iloc[:,2:]==max(d.iloc[:,2:])

2005    226699
2006    233403
2007    264727
2008    251979
2009    239995
2010    238547
2011    243311
2012    250194
2013    250567
dtype: int64

Practice on Income Dataset
    
    Combined Average Income of all states from 2005 to 2013
    State with highest average income in the last three years
    State with lowest average income from 2007 to 2010(inclusive)
    Print the list of all states in the same line with average income less than California
    Print the names of states based on descending order of income in the year 2009
    State with the lowest recorded income from 2005 to 2013

####  Combined Average Income of all states from 2005 to 2013

In [10]:
import pandas as pd
df=pd.read_csv("income.csv")
df.head()
df.head(3)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602

In [13]:
df.index=df["State"]
#df=pd.read_csv("income.csv",index_col="State")
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,,
Alabama,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [14]:
df.iloc[0:,2:].mean()# colunmn wise avg

2005    45339.8
2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [16]:
df.iloc[:,2:].mean(1)# row wise avg

State
Alabama       41126.444444
Alaska        60106.555556
Arizona       48967.888889
Arkansas      38828.888889
California    55350.444444
dtype: float64

In [17]:
df.iloc[:,2:].mean(1).mean() #combined avg

48876.04444444444

####  State with highest average income in the last three years

In [19]:
df.iloc[:,-3:] #values of last three years

             2011   2012   2013
State
Alabama     42590  43464  41381
Alaska      57431  63648  61137
Arizona     48621  47044  50602
Arkansas    41302  39018  39919
California  53367  57020  57528

In [20]:
df.iloc[:,-3:].mean(1) #row wise average of last three years

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [28]:
df.iloc[:,-3:].mean(1).idxmax()

'Alaska'

In [21]:
df["last three years avg"]=df.iloc[:,-3:].mean(1)

In [22]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
State,,,,,,,,,,,,
Alabama,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381,42478.333333
Alaska,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137,60738.666667
Arizona,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602,48755.666667
Arkansas,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919,40079.666667
California,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528,55971.666667

In [26]:
df["last three years avg"]==max(df["last three years avg"]) #boolean masking

State
Alabama       False
Alaska         True
Arizona       False
Arkansas      False
California    False
Name: last three years avg, dtype: bool

In [25]:
df[df["last three years avg"]==max(df["last three years avg"])].index[0]

'Alaska'

####  State with lowest average income from 2007 to 2010(inclusive)

In [29]:
df.iloc[:,4:8]

             2007   2008   2009   2010
State
Alabama     42212  44476  39980  40933
Alaska      62993  63989  61604  57848
Arizona     62993  46914  45739  46896
Arkansas    40795  39586  36538  38587
California  55734  57014  56134  54283

In [30]:
df.iloc[:,4:8].mean(1)

State
Alabama       41900.25
Alaska        61608.50
Arizona       50635.50
Arkansas      38876.50
California    55791.25
dtype: float64

In [31]:
df.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

#### Print the list of all states in the same line with average income less than California

In [33]:
a=df.iloc[:,2:].mean(1)
a

State
Alabama       41261.633333
Alaska        60169.766667
Arizona       48946.666667
Arkansas      38953.966667
California    55412.566667
dtype: float64

In [45]:
calavg=df.iloc[-1,2:].mean()
calavg

55412.566666666666

In [46]:
df.iloc[:,2:].mean(1)<calavg

State
Alabama        True
Alaska        False
Arizona        True
Arkansas       True
California    False
dtype: bool

In [49]:
list(df[df.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

#### Print the names of states based on descending order of income in the year 2009

In [55]:
a=df.iloc[:,6]
a

State
Alabama       39980
Alaska        61604
Arizona       45739
Arkansas      36538
California    56134
Name: 2009, dtype: int64

In [56]:
b=a.sort_values(ascending=False)
b

State
Alaska        61604
California    56134
Arizona       45739
Alabama       39980
Arkansas      36538
Name: 2009, dtype: int64

In [58]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

####  State with the lowest recorded income from 2005 to 2013

In [60]:
df.iloc[:,2:11].idxmin()

2005    Arkansas
2006    Arkansas
2007    Arkansas
2008    Arkansas
2009    Arkansas
2010    Arkansas
2011    Arkansas
2012    Arkansas
2013    Arkansas
dtype: object